{
  "adaptive_patching_levels": 3,
  "architectures": [
    "TinyTimeMixerForPrediction"
  ],
  "categorical_vocab_size_list": null,
  "context_length": 512,
  "d_model": 192,
  "d_model_scale": 3,
  "decoder_adaptive_patching_levels": 0,
  "decoder_d_model": 128,
  "decoder_d_model_scale": 2,
  "decoder_mode": "mix_channel",
  "decoder_num_layers": 2,
  "decoder_raw_residual": false,
  "distribution_output": "student_t",
  "dropout": 0.4,
  "enable_forecast_channel_mixing": true,
  "exogenous_channel_indices": [
    3,
    4,
    5,
    6,
    7,
    8,
    9,
    10,
    11,
    12,
    13
  ],
  "expansion_factor": 2,
  "fcm_context_length": 1,
  "fcm_gated_attn": true,
  "fcm_mix_layers": 2,
  "fcm_prepend_past": true,
  "fcm_prepend_past_offset": null,
  "fcm_use_mixer": true,
  "frequency_token_vocab_size": 10,
  "gated_attn": true,
  "head_dropout": 0.4,
  "huber_delta": 1,
  "init_embed": "pytorch",
  "init_linear": "pytorch",
  "init_processing": true,
  "init_std": 0.02,
  "loss": "mse",
  "mask_value": 0,
  "masked_context_length": null,
  "mode": "common_channel",
  "model_type": "tinytimemixer",
  "norm_eps": 1e-05,
  "norm_mlp": "LayerNorm",
  "num_input_channels": 14,
  "num_layers": 2,
  "num_parallel_samples": 100,
  "num_patches": 9,
  "patch_last": true,
  "patch_length": 64,
  "patch_stride": 64,
  "positional_encoding_type": "sincos",
  "post_init": false,
  "prediction_channel_indices": [
    0,
    1,
    2
  ],
  "prediction_filter_length": null,
  "prediction_length": 96,
  "quantile": 0.5,
  "resolution_prefix_tuning": true,
  "scaling": "std",
  "self_attn": false,
  "self_attn_heads": 1,
  "stride_ratio": 1,
  "torch_dtype": "float32",
  "transformers_version": "4.50.0",
  "use_decoder": true,
  "use_positional_encoding": false
}
